In [16]:
#1

In [17]:
import pandas as pd
import numpy as np

In [18]:
#seriler-----> numpy dizisi gibi

In [19]:
bnm={"ali":34,"john":36}

In [20]:
pd.Series(bnm)

ali     34
john    36
dtype: int64

In [21]:
#seri listeden

In [22]:
e=[4544,7678,324]
yer={"london","new york","roma"}

In [23]:
pd.Series(e,yer)

london      4544
roma        7678
new york     324
dtype: int64

In [24]:
pd.Series(data=e, index=yer)

london      4544
roma        7678
new york     324
dtype: int64

In [25]:
#numpy dizisiyle
nparray1=np.array([1,2,4])

In [26]:
nparray1

array([1, 2, 4])

In [27]:
pd.Series(nparray1)

0    1
1    2
2    4
dtype: int32

In [28]:
pd.Series(nparray1,yer)

london      1
roma        2
new york    4
dtype: int32

In [29]:
#series2

In [30]:
pd.Series(["ellen","ali","casey"],[1,2,3])

1    ellen
2      ali
3    casey
dtype: object

In [31]:
#indexleme mantıgı onemli

cont=pd.Series([20,3,52],["ellen","jon","ken"])

In [32]:
cont

ellen    20
jon       3
ken      52
dtype: int64

In [33]:
cont["jon"]

3

In [34]:
cont2=pd.Series([70,35,5],["ellen","jon","ken"])

In [35]:
son=cont+cont2

In [36]:
son

ellen    90
jon      38
ken      57
dtype: int64

In [37]:
# farklı stringleri eger toplamayı denersek nan cıktısı alırız

## dataframe

In [38]:
import numpy as np
import pandas as pd

In [39]:
data =np.random.randn(4,3)

In [40]:
data

array([[ 0.53192663,  0.81835714, -0.22407602],
       [ 1.19710122, -0.69432381, -0.79498652],
       [ 1.11383148,  2.19601901,  0.18238017],
       [-0.11736621,  0.77348867, -1.01682881]])

In [41]:
dataF=pd.DataFrame(data)

In [42]:
dataF

          0         1         2
0  0.531927  0.818357 -0.224076
1  1.197101 -0.694324 -0.794987
2  1.113831  2.196019  0.182380
3 -0.117366  0.773489 -1.016829

In [43]:
#index atma

In [44]:
yeni=pd.DataFrame(data,index=["jon","jane","tobby","emma"],columns=["salary","age","lucky num"])

In [45]:
yeni

         salary       age  lucky num
jon    0.531927  0.818357  -0.224076
jane   1.197101 -0.694324  -0.794987
tobby  1.113831  2.196019   0.182380
emma  -0.117366  0.773489  -1.016829

In [46]:
yeni["age"]

jon      0.818357
jane    -0.694324
tobby    2.196019
emma     0.773489
Name: age, dtype: float64

In [47]:
yeni.loc["jon"]

salary       0.531927
age          0.818357
lucky num   -0.224076
Name: jon, dtype: float64

In [48]:
#index gibi cagırmak icin columnleri alıyor
#rowları almak icin loc kullanmak gerekiyor

In [49]:
yeni.iloc[1]

salary       1.197101
age         -0.694324
lucky num   -0.794987
Name: jane, dtype: float64

In [50]:
#index mantıgıyla calıstırmak icin iloc koymak gerekiyor

In [51]:
#dfindexler

In [52]:
yeni

         salary       age  lucky num
jon    0.531927  0.818357  -0.224076
jane   1.197101 -0.694324  -0.794987
tobby  1.113831  2.196019   0.182380
emma  -0.117366  0.773489  -1.016829

In [53]:
#column ekleme
yeni["child"]=yeni["age"]*2

In [54]:
yeni

         salary       age  lucky num     child
jon    0.531927  0.818357  -0.224076  1.636714
jane   1.197101 -0.694324  -0.794987 -1.388648
tobby  1.113831  2.196019   0.182380  4.392038
emma  -0.117366  0.773489  -1.016829  1.546977

In [55]:
#cıkarma

In [56]:
yeni.drop("age",axis=1)  #column

         salary  lucky num     child
jon    0.531927  -0.224076  1.636714
jane   1.197101  -0.794987 -1.388648
tobby  1.113831   0.182380  4.392038
emma  -0.117366  -1.016829  1.546977

In [57]:
yeni.drop("emma",axis=0) #row

         salary       age  lucky num     child
jon    0.531927  0.818357  -0.224076  1.636714
jane   1.197101 -0.694324  -0.794987 -1.388648
tobby  1.113831  2.196019   0.182380  4.392038

In [58]:
yeni

         salary       age  lucky num     child
jon    0.531927  0.818357  -0.224076  1.636714
jane   1.197101 -0.694324  -0.794987 -1.388648
tobby  1.113831  2.196019   0.182380  4.392038
emma  -0.117366  0.773489  -1.016829  1.546977

In [59]:
#bunu nasıl degistiririz???

In [60]:
yeni.drop("emma",axis=0,inplace=True) #row

In [61]:
yeni.loc["jane"]["age"]

-0.6943238091387528

In [62]:
yeni

         salary       age  lucky num     child
jon    0.531927  0.818357  -0.224076  1.636714
jane   1.197101 -0.694324  -0.794987 -1.388648
tobby  1.113831  2.196019   0.182380  4.392038

In [63]:
yeni<0

       salary    age  lucky num  child
jon     False  False       True  False
jane    False   True       True   True
tobby   False  False      False  False

In [64]:
yeni[yeni["age"]<0]

        salary       age  lucky num     child
jane  1.197101 -0.694324  -0.794987 -1.388648

In [65]:
#bu sekilde filtreledik

## index degistirme

In [66]:
yeni

         salary       age  lucky num     child
jon    0.531927  0.818357  -0.224076  1.636714
jane   1.197101 -0.694324  -0.794987 -1.388648
tobby  1.113831  2.196019   0.182380  4.392038

In [67]:
yeni.reset_index()

   index    salary       age  lucky num     child
0    jon  0.531927  0.818357  -0.224076  1.636714
1   jane  1.197101 -0.694324  -0.794987 -1.388648
2  tobby  1.113831  2.196019   0.182380  4.392038

In [68]:
#isimlerin degismesi

In [69]:
yeniL=["j","j1","t"]

In [70]:
yeni["isim"] =yeniL

In [71]:
yeniL

['j', 'j1', 't']

In [77]:
yeni

         salary       age  lucky num     child isim
jon    0.531927  0.818357  -0.224076  1.636714    j
jane   1.197101 -0.694324  -0.794987 -1.388648   j1
tobby  1.113831  2.196019   0.182380  4.392038    t

In [78]:
yeni.set_index("isim",inplace=True)

In [80]:
yeni

        salary       age  lucky num     child
isim
j     0.531927  0.818357  -0.224076  1.636714
j1    1.197101 -0.694324  -0.794987 -1.388648
t     1.113831  2.196019   0.182380  4.392038

## multi index

In [96]:
#tablonunn altgruplu olması

In [97]:
ilkIndex= ["netflix","netflix","netflix","hbo","hbo","amazon"]

In [98]:
icIndex=["stranger things","dark","vis a vis","euphoria","got","fleebag"]

In [99]:
bir=list(zip(ilkIndex,icIndex))

In [100]:
bir

[('netflix', 'stranger things'),
 ('netflix', 'dark'),
 ('netflix', 'vis a vis'),
 ('hbo', 'euphoria'),
 ('hbo', 'got'),
 ('amazon', 'fleebag')]

In [102]:
bir =pd.MultiIndex.from_tuples(bir)

In [104]:
bir

MultiIndex([('netflix', 'stranger things'),
            ('netflix',            'dark'),
            ('netflix',       'vis a vis'),
            (    'hbo',        'euphoria'),
            (    'hbo',             'got'),
            ( 'amazon',         'fleebag')],
           )

In [105]:
b=[[8,"child"],[9,"scifi"],[8.5,"action"],[7,"young"],[10,"history"],[8,"comedy"]]

In [106]:
bNum=np.array(b)

In [109]:
son=pd.DataFrame(bNum,index=bir,columns=["imdb","genre"])

In [110]:
son

                        imdb    genre
netflix stranger things    8    child
        dark               9    scifi
        vis a vis        8.5   action
hbo     euphoria           7    young
        got               10  history
amazon  fleebag            8   comedy

In [111]:
son.loc["netflix"]

                imdb   genre
stranger things    8   child
dark               9   scifi
vis a vis        8.5  action

## eksik veriler

In [115]:
celeb={"johnny deep":[3,5,5],"josh connor":[np.nan,1,0],"brad pitt":[3,7,4]}
prizes=pd.DataFrame(celeb)

In [116]:
prizes

   johnny deep  josh connor  brad pitt
0            3          NaN          3
1            5          1.0          7
2            5          0.0          4

In [118]:
#dropna dersek hepsini siler-----> prizes.dropna()

In [119]:
prizes.dropna(axis=1)

   johnny deep  brad pitt
0            3          3
1            5          7
2            5          4

In [121]:
celeb={"johnny deep":[3,5,5],"josh connor":[np.nan,1,0],"brad pitt":[3,7,4],"ryan reynolds":[3,np.nan,np.nan]}
prizes=pd.DataFrame(celeb)

In [122]:
prizes

   johnny deep  josh connor  brad pitt  ryan reynolds
0            3          NaN          3            3.0
1            5          1.0          7            NaN
2            5          0.0          4            NaN

In [127]:
prizes.dropna(axis=1,thresh=2)

   johnny deep  josh connor  brad pitt
0            3          NaN          3
1            5          1.0          7
2            5          0.0          4

In [129]:
prizes.fillna(0)

   johnny deep  josh connor  brad pitt  ryan reynolds
0            3          0.0          3            3.0
1            5          1.0          7            0.0
2            5          0.0          4            0.0

In [130]:
#gruplandırma---> groupbymetodu

In [143]:
tv={"tv shows":["the crown","prison break","shameless","dark"],
   "imdb":[7,8,6,10]}

In [144]:
tvdta=pd.DataFrame(tv)

In [145]:
tvdta

       tv shows  imdb
0     the crown     7
1  prison break     8
2     shameless     6
3          dark    10

In [146]:
objk=tvdta.groupby("imdb")

In [147]:
objk.count()

      tv shows
imdb
6            1
7            1
8            1
10           1

In [148]:
objk.max()

          tv shows
imdb
6        shameless
7        the crown
8     prison break
10            dark

In [149]:
objk.min()

          tv shows
imdb
6        shameless
7        the crown
8     prison break
10            dark